Tekla.Structures.Model.BaseWeld.WeldFinishEnum
The weld finish.

Tekla.Structures.Model.BaseWeld.WeldFinishEnum.WELD_FINISH_NONE
No weld finish.

Tekla.Structures.Model.BaseWeld.WeldFinishEnum.WELD_FINISH_GRIND
The grind finish.

Tekla.Structures.Model.BaseWeld.WeldFinishEnum.WELD_FINISH_MACHINE
The machine finish.

Tekla.Structures.Model.BaseWeld.WeldFinishEnum.WELD_FINISH_CHIP
The chip finish.

Tekla.Structures.Model.BaseWeld.WeldFinishEnum.WELD_FINISH_FINISHED_WELD
The normally treated finish.

Tekla.Structures.Model.BaseWeld.WeldFinishEnum.WELS_FINISH_SMOOTH_TRANSITION
The smooth transition finish.